### Terraform Plan Output - Part # 1
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Validation 🤖`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # azurerm_resource_group.rsi will be created
  + resource "azurerm_resource_group" "rsi" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "rsi-rg"
    }

  # azurerm_route_table.rsi-routetable-be will be created
  + resource "azurerm_route_table" "rsi-routetable-be" {
      + disable_bgp_route_propagation = false
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "rsi-rt-be"
      + resource_group_name           = "rsi-rg"
      + route                         = (known after apply)
      + subnets                       = (known after apply)
      + tags                          = {
          + "Component"   = "Backend"
          + "Region"      = "uk south"
          + "Terraform"   = "true"
          + "environment" = "dev"
        }
    }

  # azurerm_route_table.rsi-routetable-fe will be created
  + resource "azurerm_route_table" "rsi-routetable-fe" {
      + disable_bgp_route_propagation = false
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "rsi-rt-fe"
      + resource_group_name           = "rsi-rg"
      + route                         = (known after apply)
      + subnets                       = (known after apply)
      + tags                          = {
          + "Component"   = "Frontend"
          + "Region"      = "uk south"
          + "Terraform"   = "true"
          + "environment" = "dev"
        }
    }

  # azurerm_virtual_network_peering.rsi-be-to-fe will be created
  + resource "azurerm_virtual_network_peering" "rsi-be-to-fe" {
      + allow_forwarded_traffic      = false
      + allow_gateway_transit        = false
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "beTofe"
      + remote_virtual_network_id    = (known after apply)
      + resource_group_name          = "rsi-rg"
      + triggers                     = {
          + "remote_address_space" = "10.0.0.0/16"
        }
      + use_remote_gateways          = false
      + virtual_network_name         = (known after apply)
    }

  # azurerm_virtual_network_peering.rsi-fe-to-be will be created
  + resource "azurerm_virtual_network_peering" "rsi-fe-to-be" {
      + allow_forwarded_traffic      = false
      + allow_gateway_transit        = false
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "feTobe"
      + remote_virtual_network_id    = (known after apply)
      + resource_group_name          = "rsi-rg"
      + triggers                     = {
          + "remote_address_space" = "10.1.0.0/16"
        }
      + use_remote_gateways          = false
      + virtual_network_name         = (known after apply)
    }

  # module.fe-loadbalancer.data.azurerm_resource_group.azlb will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "azlb" {
      + id         = (known after apply)
      + location   = (known after apply)
      + managed_by = (known after apply)
      + name       = "rsi-rg"
      + tags       = (known after apply)
    }

  # module.fe-loadbalancer.azurerm_lb.azlb will be created
  + resource "azurerm_lb" "azlb" {
      + id                   = (known after apply)
      + location             = "uksouth"
      + name                 = "fe-lb"
      + private_ip_address   = (known after apply)
      + private_ip_addresses = (known after apply)
      + resource_group_name  = "rsi-rg"
      + sku                  = "Standard"
      + sku_tier             = "Regional"
      + tags                 = {
          + "Component"   = "Frontend"
          + "Region"      = "uk south"
          + "Terraform"   = "true"
          + "environment" = "dev"
        }

      + frontend_ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + id                                                 = (known after apply)
          + inbound_nat_rules                                  = (known after apply)
          + load_balancer_rules                                = (known after apply)
          + name                                               = "myPublicIP"
          + outbound_rules                                     = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = (known after apply)
          + public_ip_address_id                               = (known after apply)
          + public_ip_prefix_id                                = (known after apply)
          + subnet_id                                          = (known after apply)
        }
    }

  # module.fe-loadbalancer.azurerm_lb_backend_address_pool.azlb will be created
  + resource "azurerm_lb_backend_address_pool" "azlb" {
      + backend_ip_configurations = (known after apply)
      + id                        = (known after apply)
      + inbound_nat_rules         = (known after apply)
      + load_balancing_rules      = (known after apply)
      + loadbalancer_id           = (known after apply)
      + name                      = "BackEndAddressPool"
      + outbound_rules            = (known after apply)
    }

  # module.fe-loadbalancer.azurerm_lb_probe.azlb[0] will be created
  + resource "azurerm_lb_probe" "azlb" {
      + id                  = (known after apply)
      + interval_in_seconds = 5
      + load_balancer_rules = (known after apply)
      + loadbalancer_id     = (known after apply)
      + name                = "http"
      + number_of_probes    = 2
      + port                = 80
      + probe_threshold     = 1
      + protocol            = "Tcp"
    }

  # module.fe-loadbalancer.azurerm_lb_rule.azlb[0] will be created
  + resource "azurerm_lb_rule" "azlb" {
      + backend_address_pool_ids       = (known after apply)
      + backend_port                   = 80
      + disable_outbound_snat          = false
      + enable_floating_ip             = false
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "myPublicIP"
      + frontend_port                  = 80
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = 5
      + load_distribution              = (known after apply)
      + loadbalancer_id                = (known after apply)
      + name                           = "http"
      + probe_id                       = (known after apply)
      + protocol                       = "Tcp"
    }

  # module.fe-loadbalancer.azurerm_lb_rule.azlb[1] will be created
  + resource "azurerm_lb_rule" "azlb" {
      + backend_address_pool_ids       = (known after apply)
      + backend_port                   = 80
      + disable_outbound_snat          = false
      + enable_floating_ip             = false
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "myPublicIP"
      + frontend_port                  = 443
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = 5
      + load_distribution              = (known after apply)
      + loadbalancer_id                = (known after apply)
      + name                           = "https"
      + probe_id                       = (known after apply)
      + protocol                       = "Tcp"
    }

  # module.fe-loadbalancer.azurerm_public_ip.azlb[0] will be created
  + resource "azurerm_public_ip" "azlb" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "uksouth"
      + name                    = "fe-lb-pip"
      + resource_group_name     = "rsi-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "Component"   = "Frontend"
          + "Region"      = "uk south"
          + "Terraform"   = "true"
          + "environment" = "dev"
        }
    }

  # module.nsg-be.data.azurerm_resource_group.nsg will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "nsg" {
      + id         = (known after apply)
      + location   = (known after apply)
      + managed_by = (known after apply)
      + name       = "rsi-rg"
      + tags       = (known after apply)
    }

  # module.nsg-be.azurerm_network_security_group.nsg will be created
  + resource "azurerm_network_security_group" "nsg" {
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "rsi-nsg-backend"
      + resource_group_name = "rsi-rg"
      + security_rule       = (known after apply)
      + tags                = {
          + "Component"   = "Backend"
          + "Region"      = "uk south"
          + "Terraform"   = "true"
          + "environment" = "dev"
        }
    }

  # module.nsg-be.azurerm_network_security_rule.custom_rules[0] will be created
  + resource "azurerm_network_security_rule" "custom_rules" {
      + access                      = "Allow"
      + description                 = "FrontendAllowSSH"
      + destination_address_prefix  = "*"
      + destination_port_ranges     = [
          + "22",
        ]
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "SSH-FE"
      + network_security_group_name = "rsi-nsg-backend"
      + priority                    = 101
      + protocol                    = "Tcp"
      + resource_group_name         = "rsi-rg"
      + source_address_prefix       = "10.0.2.0/24"
      + source_port_range           = "*"
    }

  # module.nsg-be.azurerm_network_security_rule.custom_rules[1] will be created
  + resource "azurerm_network_security_rule" "custom_rules" {
      + access                      = "Allow"
      + description                 = "FrontendAllowSSH"
      + destination_address_prefix  = "*"
      + destination_port_ranges     = [
          + "0-65535",
        ]
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "ICMP-FE"
      + network_security_group_name = "rsi-nsg-backend"
      + priority                    = 102
      + protocol                    = "Icmp"
      + resource_group_name         = "rsi-rg"
      + source_address_prefix       = "10.0.2.0/24"
      + source_port_range           = "*"
    }

  # module.nsg-be.azurerm_network_security_rule.custom_rules[2] will be created
  + resource "azurerm_network_security_rule" "custom_rules" {
      + access                      = "Allow"
      + description                 = "FrontendAllowMySQL"
      + destination_address_prefix  = "*"
      + destination_port_ranges     = [
          + "3306",
        ]
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "MySQL-DB-FE"
      + network_security_group_name = "rsi-nsg-backend"
      + priority                    = 201
      + protocol                    = "Tcp"
      + resource_group_name         = "rsi-rg"
      + source_address_prefix       = "10.0.2.0/24"
      + source_port_range           = "*"
    }

  # module.nsg-be.azurerm_network_security_rule.custom_rules[3] will be created
  + resource "azurerm_network_security_rule" "custom_rules" {
      + access                      = "Deny"
      + description                 = "default-deny"
      + destination_address_prefix  = "*"
      + destination_port_ranges     = [
          + "0-65535",
        ]
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "DENY"
      + network_security_group_name = "rsi-nsg-backend"
      + priority                    = 4096
      + protocol                    = "Tcp"
      + resource_group_name         = "rsi-rg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.nsg-fe.data.azurerm_resource_group.nsg will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "nsg" {
      + id         = (known after apply)
      + location   = (known after apply)
      + managed_by = (known after apply)
      + name       = "rsi-rg"
      + tags       = (known after apply)
    }

  # module.nsg-fe.azurerm_network_security_group.nsg will be created
  + resource "azurerm_network_security_group" "nsg" {
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "rsi-nsg-frontend"
      + resource_group_name = "rsi-rg"
      + security_rule       = (known after apply)
      + tags                = {
          + "Component"   = "Frontend"
          + "Region"      = "uk south"
          + "Terraform"   = "true"
          + "environment" = "dev"
        }
    }

  # module.nsg-fe.azurerm_network_security_rule.custom_rules[0] will be created
  + resource "azurerm_network_security_rule" "custom_rules" {
      + access                      = "Allow"
      + description                 = "AzureLoadBalancerAllowed"
      + destination_address_prefix  = "*"
      + destination_port_ranges     = [
          + "0-65535",
        ]
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "AzureLoadBalancer"
      + network_security_group_name = "rsi-nsg-frontend"
      + priority                    = 101
      + protocol                    = "Tcp"
      + resource_group_name         = "rsi-rg"
      + source_address_prefix       = "AzureLoadBalancer"
      + source_port_range           = "*"
    }

  # module.nsg-fe.azurerm_network_security_rule.custom_rules[1] will be created
  + resource "azurerm_network_security_rule" "custom_rules" {
      + access                      = "Deny"
      + description                 = "default-deny"
      + destination_address_prefix  = "*"
      + destination_port_ranges     = [
          + "0-65535",
        ]
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "DENY"
      + network_security_group_name = "rsi-nsg-frontend"
      + priority                    = 4096
      + protocol                    = "Tcp"
      + resource_group_name         = "rsi-rg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.nsg-public.data.azurerm_resource_group.nsg will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "nsg" {
      + id         = (known after apply)
      + location   = (known after apply)
      + managed_by = (known after apply)
      + name       = "rsi-rg"
      + tags       = (known after apply)
    }

  # module.nsg-public.azurerm_network_security_group.nsg will be created
  + resource "azurerm_network_security_group" "nsg" {
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "rsi-nsg-public"
      + resource_group_name = "rsi-rg"
      + security_rule       = (known after apply)
      + tags                = {
          + "Component"   = "Frontend"
          + "Public"      = "true"
          + "Region"      = "uk south"
          + "Terraform"   = "true"
          + "environment" = "dev"
        }
    }

  # module.nsg-public.azurerm_network_security_rule.custom_rules[0] will be created
  + resource "azurerm_network_security_rule" "custom_rules" {
      + access                      = "Deny"
      + description                 = "default-deny"
      + destination_address_prefix  = "*"
      + destination_port_ranges     = [
          + "0-65535",
        ]
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "DENY"
      + network_security_group_name = "rsi-nsg-public"
      + priority                    = 4096
      + protocol                    = "Tcp"
      + resource_group_name         = "rsi-rg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.nsg-public.azurerm_network_security_rule.predefined_rules[0] will be created
  + resource "azurerm_network_security_rule" "predefined_rules" {
      + access                      = "Allow"
      + description                 = "HTTP"
      + destination_address_prefix  = "*"
      + destination_port_range      = "80"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "HTTP"
      + network_security_group_name = "rsi-nsg-public"
      + priority                    = 101
      + protocol                    = "Tcp"
      + resource_group_name         = "rsi-rg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.nsg-public.azurerm_network_security_rule.predefined_rules[1] will be created
  + resource "azurerm_network_security_rule" "predefined_rules" {
      + access                      = "Allow"
      + description                 = "HTTPS"
      + destination_address_prefix  = "*"
      + destination_port_range      = "443"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "HTTPS"
      + network_security_group_name = "rsi-nsg-public"
      + priority                    = 201
      + protocol                    = "Tcp"
      + resource_group_name         = "rsi-rg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.rsi-be.azurerm_subnet.subnet_for_each["backend"] will be created
  + resource "azurerm_subnet" "subnet_for_each" {
      + address_prefixes                               = [
          + "10.1.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "backend"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rsi-rg"
      + virtual_network_name                           = "acctvnet"
    }

  # module.rsi-be.azurerm_subnet_network_security_group_association.vnet["backend"] will be created
  + resource "azurerm_subnet_network_security_group_association" "vnet" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.rsi-be.azurerm_subnet_route_table_association.vnet["backend"] will be created
  + resource "azurerm_subnet_route_table_association" "vnet" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.rsi-be.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.1.0.0/16",
        ]
      + dns_servers         = []
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "acctvnet"
      + resource_group_name = "rsi-rg"
      + subnet              = (known after apply)
      + tags                = {
          + "Component"   = "Backend"
          + "Region"      = "uk south"
          + "Terraform"   = "true"
          + "environment" = "dev"
        }
    }

  # module.rsi-fe.azurerm_subnet.subnet_for_each["frontend"] will be created
  + resource "azurerm_subnet" "subnet_for_each" {
      + address_prefixes                               = [
          + "10.0.2.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "frontend"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rsi-rg"
      + virtual_network_name                           = "acctvnet"
    }

  # module.rsi-fe.azurerm_subnet.subnet_for_each["public"] will be created
  + resource "azurerm_subnet" "subnet_for_each" {
      + address_prefixes                               = [
          + "10.0.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "public"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rsi-rg"
      + virtual_network_name                           = "acctvnet"
    }

  # module.rsi-fe.azurerm_subnet_network_security_group_association.vnet["frontend"] will be created
  + resource "azurerm_subnet_network_security_group_association" "vnet" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.rsi-fe.azurerm_subnet_network_security_group_association.vnet["public"] will be created
  + resource "azurerm_subnet_network_security_group_association" "vnet" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.rsi-fe.azurerm_subnet_route_table_association.vnet["frontend"] will be created
  + resource "azurerm_subnet_route_table_association" "vnet" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.rsi-fe.azurerm_subnet_route_table_association.vnet["public"] will be created
  + resource "azurerm_subnet_route_table_association" "vnet" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.rsi-fe.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = []
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "acctvnet"
      + resource_group_name = "rsi-rg"
      + subnet              = (known after apply)
      + tags                = {
          + "Component"   = "Frontend"
          + "Region"      = "uk south"
          + "Terraform"   = "true"
          + "environment" = "dev"
        }
    }

Plan: 34 to add, 0 to change, 0 to destroy.

  ```
  </details>
  *Pusher: @MartyFox, Action: `pull_request`, Working Directory: `terraform`, Workflow: `Terraform Pull Request Plan`*